package by.epam.tc.modul1.cycles.task6;

/*
 	Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера.
 */

public class Task6 {

	public static void main(String[] args) {

for (char s = 'A' ;s<= 'Z';  s++ ) {
	System.out.println("Символ: " + s + "; " + "Кодировка: " + (int)s);
}	
	
	
		
		}
		
	}


